Revit 2026 API

# IFCGuidKey(IFCGuidKey) Constructor

---

IFCGuidKey can be used in managed code as well as unmanaged.

**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public IFCGuidKey(
	IFCGuidKey other
)
```
```vb
Public Sub New (
	other As IFCGuidKey
)
```
```cpp
public:
IFCGuidKey(
	IFCGuidKey^ other
)
```
```fsharp
new :
        other : IFCGuidKey -> IFCGuidKey
```

#### Parameters

other IFCGuidKey

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

IFCGuidKey Class

IFCGuidKey Overload

Autodesk.Revit.DB.IFC Namespace